<a href="https://colab.research.google.com/github/MuhammadHamzaAfzal/Python_Class_Work_jz/blob/master/Pandas_8.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Chapter 8

In [0]:
import pandas as pd
import numpy as np

In [0]:
age = [20,22,26,27,21,55,41,67]
bins = [15,22,35,45,55,70]
c = pd.cut(age , bins)

In [5]:
c

[(15, 22], (15, 22], (22, 35], (22, 35], (15, 22], (45, 55], (35, 45], (55, 70]]
Categories (5, interval[int64]): [(15, 22] < (22, 35] < (35, 45] < (45, 55] < (55, 70]]

In [6]:
c.codes

array([0, 0, 1, 1, 0, 3, 2, 4], dtype=int8)

In [0]:
marks=[77,60,50,80,75,65,92]
grades=[60,70,80,90]
c=pd.cut(marks , grades)

In [8]:
c

[(70.0, 80.0], NaN, NaN, (70.0, 80.0], (70.0, 80.0], (60.0, 70.0], NaN]
Categories (3, interval[int64]): [(60, 70] < (70, 80] < (80, 90]]

In [0]:
marks = [65,75,65,80,91,53]
grade = [0,60,70,80,90,100]
cats = pd.cut(marks , grade)

In [0]:
lst = np.array(["F","C","B","A","A+"])

In [11]:
lst[cats.codes]

array(['C', 'B', 'C', 'B', 'A+', 'F'], dtype='<U2')

In [12]:
data = [50,120,70,80,65,75,95,99,100,102]
bp = [0,60,80,90,100,120]
bins = pd.cut(data , bp)
state=np.array(["low","Normal","Pre-Hypertension","Grade I Hypertension","Grade II Hypertension"])
state[bins.codes]

array(['low', 'Grade II Hypertension', 'Normal', 'Normal', 'Normal',
       'Normal', 'Grade I Hypertension', 'Grade I Hypertension',
       'Grade I Hypertension', 'Grade II Hypertension'], dtype='<U21')

In [13]:
df=pd.DataFrame(np.random.randn(20).reshape(5,4))
display(df)
sampler=np.random.permutation(5)
df.take(sampler)

          0         1         2         3
0 -1.107909 -1.521746 -0.333796  1.281764
1 -2.020575 -0.482560 -0.123263  0.972051
2  0.855777 -0.558889  1.975040 -0.282550
3  1.383113 -0.319979  0.046950 -0.038680
4 -0.219095  1.668601 -0.759743  1.278391

          0         1         2         3
0 -1.107909 -1.521746 -0.333796  1.281764
2  0.855777 -0.558889  1.975040 -0.282550
3  1.383113 -0.319979  0.046950 -0.038680
1 -2.020575 -0.482560 -0.123263  0.972051
4 -0.219095  1.668601 -0.759743  1.278391

In [14]:
df.sample(frac=0.6, replace=False)

          0         1         2         3
1 -2.020575 -0.482560 -0.123263  0.972051
4 -0.219095  1.668601 -0.759743  1.278391
2  0.855777 -0.558889  1.975040 -0.282550

In [0]:
df1 = pd.DataFrame({"Name":["Umer","Bilal","Ali","Usman"],
                    "Age":(np.random.randn(4))}).set_index("Name")

In [40]:
df1

            Age
Name
Umer   0.192110
Bilal -1.128040
Ali    0.063705
Usman  0.242609

In [0]:
df2 = pd.DataFrame({"SName":["Umer","Bilal","Ali","Hamza"],
                    "Gpa":(np.random.randn(4))}).set_index("SName")

In [42]:
df2

            Gpa
SName
Umer  -1.652124
Bilal -0.153413
Ali   -0.263506
Hamza -0.179645

In [43]:
df1.join(df2)

            Age       Gpa
Name
Umer   0.192110 -1.652124
Bilal -1.128040 -0.153413
Ali    0.063705 -0.263506
Usman  0.242609       NaN

In [44]:
df2.join(df1)

            Gpa       Age
SName
Umer  -1.652124  0.192110
Bilal -0.153413 -1.128040
Ali   -0.263506  0.063705
Hamza -0.179645       NaN

In [0]:
a = pd.Series([23,34,56,78] , index = ["b", "d", "a", "c"])
b = pd.Series([44,67,89,90])

In [0]:
x = pd.concat([a , b] , sort = True , axis = 1)

In [52]:
x

      0     1
0   NaN  44.0
1   NaN  67.0
2   NaN  89.0
3   NaN  90.0
a  56.0   NaN
b  23.0   NaN
c  78.0   NaN
d  34.0   NaN

In [47]:
pd.concat([df1 , df2] , sort = True)

            Age       Gpa
Umer   0.192110       NaN
Bilal -1.128040       NaN
Ali    0.063705       NaN
Usman  0.242609       NaN
Umer        NaN -1.652124
Bilal       NaN -0.153413
Ali         NaN -0.263506
Hamza       NaN -0.179645

# Heirarchical Indexing

In [0]:
df = pd.Series(np.random.randn(10),
               index = [["Karachi","Karachi"
               ,"Karachi","Karachi",
               "lahore","lahore","lahore",
               "Islamabad","Peshawar" , "Peshawar"],
               ["Dhoraji" , "Sharfabad" ,"Tariq Road" , "Defence" ,
                "Gulberg","Iqbal Road", "Model Town",
                "F-9", "Khyber" , "Qissa Khuwani Bazar"]])

In [57]:
df

Karachi    Dhoraji                1.207977
           Sharfabad             -0.362526
           Tariq Road            -0.435497
           Defence                1.252113
lahore     Gulberg               -0.251263
           Iqbal Road             0.507027
           Model Town            -1.095538
Islamabad  F-9                    0.421213
Peshawar   Khyber                 0.419493
           Qissa Khuwani Bazar    0.621943
dtype: float64

In [58]:
df["Karachi"]

Dhoraji       1.207977
Sharfabad    -0.362526
Tariq Road   -0.435497
Defence       1.252113
dtype: float64

In [60]:
df["Karachi"].iloc[1:]

Sharfabad    -0.362526
Tariq Road   -0.435497
Defence       1.252113
dtype: float64

In [61]:
df["Karachi"].iloc[[1,3]]

Sharfabad   -0.362526
Defence      1.252113
dtype: float64

In [62]:
df.unstack()

            Defence   Dhoraji  ...  Sharfabad  Tariq Road
Islamabad       NaN       NaN  ...        NaN         NaN
Karachi    1.252113  1.207977  ...  -0.362526   -0.435497
Peshawar        NaN       NaN  ...        NaN         NaN
lahore          NaN       NaN  ...        NaN         NaN

[4 rows x 10 columns]

In [63]:
df.unstack().stack()

Islamabad  F-9                    0.421213
Karachi    Defence                1.252113
           Dhoraji                1.207977
           Sharfabad             -0.362526
           Tariq Road            -0.435497
Peshawar   Khyber                 0.419493
           Qissa Khuwani Bazar    0.621943
lahore     Gulberg               -0.251263
           Iqbal Road             0.507027
           Model Town            -1.095538
dtype: float64

In [0]:
df.index.names = ["City" , "Area"]

In [65]:
df

City       Area
Karachi    Dhoraji                1.207977
           Sharfabad             -0.362526
           Tariq Road            -0.435497
           Defence                1.252113
lahore     Gulberg               -0.251263
           Iqbal Road             0.507027
           Model Town            -1.095538
Islamabad  F-9                    0.421213
Peshawar   Khyber                 0.419493
           Qissa Khuwani Bazar    0.621943
dtype: float64

In [66]:
df.swaplevel("City" , "Area")

Area                 City
Dhoraji              Karachi      1.207977
Sharfabad            Karachi     -0.362526
Tariq Road           Karachi     -0.435497
Defence              Karachi      1.252113
Gulberg              lahore      -0.251263
Iqbal Road           lahore       0.507027
Model Town           lahore      -1.095538
F-9                  Islamabad    0.421213
Khyber               Peshawar     0.419493
Qissa Khuwani Bazar  Peshawar     0.621943
dtype: float64